[
  {
    "name": "Меркурій",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Mercury_in_color_-_Prockter07_centered.jpg/420px-Mercury_in_color_-_Prockter07_centered.jpg",
    "description": "Перша особливість цієї планети – її розміри. Меркурій – найменша планета нашої Сонячної Системи. Розміри планети лише трохи більше нашого Місяця. Діаметр Меркурія складає 4990 км. Для порівняння – діаметр нашої Землі – 12760 км. Крім того, Меркурій – найближча до Сонця планета, тому цілком можливо один раз побачити її на власні очі на небі рано вранці або пізно ввечері. Недарма планету називають Ранкова зірка або Вечірня зірка. Правда з’являється ця “Зірка” на небі на дуже короткий час, наприклад, відразу після заходу сонця. Меркурій – найшвидша планета. У своєму обертанні навколо Сонця вона проходить свою орбіту за 88 земних діб. Тобто рік на Меркурії триває всього 88 земних дня. На Меркурії зафіксований найбільший перепад температур, знову таки через близькість до Сонця. Вдень температура там піднімається до 430 градусів Цельсія, а вночі опускається до мінус 180 градусів Цельсія, при цьому різниця температур досягає більше 600 градусів."
  },
  {
    "name": "Венера",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Venus_from_Mariner_10.jpg/420px-Venus_from_Mariner_10.jpg",
    "description": "Венера — друга планета від Сонця, названа ім'ям давньоримської богині кохання та краси Венери. Венера належить до планет земної групи. Венера обертається навколо Сонця за 225 земних діб, а оберт навколо своєї осі триває 243 земні доби. Супутників у Венери немає. Атмосфера Венери гаряча та густа. Тиск на поверхню більший за земний у 92 рази. Внаслідок парникового ефекту температура на поверхні Венери складає 464 °C. оверхню повністю закривають хмари з сірчаної кислоти, які відбивають сонячне світло та роблять Венеру «сяючою» при спостереженні з Землі. Імовірно, поверхня Венери складається з базальту. Близько 80 % поверхні складають рівнини, решта — метеоритні кратери, вулкани та тессери. У планети є магнітне поле, яке виникає внаслідок взаємодії сонячного вітру та заряджених атомів у верхніх шарах атмосфери. Одні з перших письмових згадок Венери знайдено в манускриптах Вавилонії близько 1600 року до н. е. Діаметр Венери складає 12 104 км."
  },
  {
    "name": "Земля",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Africa_and_Europe_from_a_Million_Miles_Away.png/405px-Africa_and_Europe_from_a_Million_Miles_Away.png",
    "description": "Земля́ — третя від Сонця планета Сонячної системи, єдина планета, на якій відоме життя, домівка людства. Земля належить до планет земної групи і є найбільшою з цих планет у Сонячній системі. Земля утворилася приблизно 4,5 мільярди років тому з газо-пилової хмари. Земля розташована на відстані ~149,6 млн км від Сонця та обертається навколо нього, здійснюючи один оберт за рік. Сонячна система разом із Землею розташована в галактиці Чумацький шлях, в рукаві Оріона, на відстані 28 000 світлових років від галактичного центру. Земля наближено являє собою еліпсоїд з середнім радіусом близько 6400 км. Середня густина Землі найбільша серед усіх планет Сонячної системи.  Її тіло диференційоване та складається з кількох шарів: внутрішнього ядра, зовнішнього ядра, мантії та кори. Земля має один постійний природний супутник, Місяць, що обертається на відстані 380 000 км та має розмір ~1700 км. Атмосфера Землі складається здебільшого з азоту та кисню."
  },
  {
    "name": "Марс",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Mars_Valles_Marineris_EDIT.jpg/411px-Mars_Valles_Marineris_EDIT.jpg",
    "description": "Марс — четверта планета Сонячної системи за відстанню від Сонця. Названа на честь Марса — давньоримського бога війни. Іноді Марс називають «червоною планетою» через червонуватий колір поверхні, який є наслідком наявності великої кількості мінералу маггеміту — γ-оксиду заліза(III). Це кам'яниста планета земного типу з розрідженою атмосферою. Марс є сьомим за розміром і масою. Прискорення вільного падіння на поверхні Марса складає приблизно 3,72 м/с². У планети є два супутники, Фобос і Деймос. Рельєф поверхні Марса дуже різноманітний: кам'янисті рівнини, численні кратери, гори, згаслі вулкани, рифтоподібні системи каньйонів та полярні шапки з льодовиків. У розрідженій атмосфері іноді відбуваються пилові бурі, а також можуть утворюватися короткотривалі вихори. На поверхні Марса є численні сліди наявності в далекому минулому великих запасів рідкої води. Вчені також припускають, що в далекому минулому на поверхні Марса могло існувати життя."
  },
  {
    "name": "Юпітер",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Jupiter%2C_image_taken_by_NASA%27s_Hubble_Space_Telescope%2C_June_2019_-_Edited.jpg/450px-Jupiter%2C_image_taken_by_NASA%27s_Hubble_Space_Telescope%2C_June_2019_-_Edited.jpg",
    "description": "Юпі́тер — п'ята від Сонця та найбільша планета Сонячної системи. Відстань Юпітера від Сонця змінюється в межах від 740—814 млн км. Юпітер класифікується як газовий гігант. Орбітальний період планети становить 11,862 років, синодичний — 466,72 діб. Маса Юпітера більш ніж удвічі перевищує масу усіх планет Сонячної системи разом узятих(1,8986× 10²⁷ кг). Юпітер, через механізм Кельвіна — Гельмгольца, випромінює теплову енергію, еквівалентну 4·10¹⁷ Вт. Низка атмосферних явищ на Юпітері — як-от шторми, блискавки, полярні сяйва, вихори (циклони й антициклони), мають масштаби, що значно перевершують земні. Примітним утворенням в атмосфері є Велика червона пляма — величезний шторм-антициклон, який існує вже принаймні 350 років і вперше спостерігався у 1831. Юпітер має 95 відомих супутників, найбільші з яких — Іо, Європа, Ганімед і Каллісто — було відкрито 1610 року Галілео Галілеєм. Окрім численних супутників. Юпітер має власну систему тонких і тьмяних кілець."
  },
  {
    "name": "Сатурн",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Saturn_-_April_25_2016_%2837612580000%29.png/450px-Saturn_-_April_25_2016_%2837612580000%29.png",
    "description": "Сатурн — шоста за віддаленістю планета від Сонця і друга за розміром у Сонячній системі. Це газовий гігант, який складається переважно з водню та гелію. Радіус Сатурна лише на 16 % менше радіуса Юпітера(58 232 км), але його маса складає менше третини від маси Юпітера(5,6846× 10²⁶ кг). Планета обертається навколо Сонця на відстані 9,59 астрономічної одиниці (1434 млн км), з орбітальним періодом 29,45 року. Сатурн швидко обертається навколо своєї осі (з періодом — 10,23 години), має товстий шар атмосфери. В атмосфері Сатурна міститься 94 % водню і 6 % гелію (за об'ємом). Спостерігається величезне овальне утворення розміром із Землю, розташоване недалеко від північного полюса, назване Великою білою плямою. Швидкості зональних вітрів поблизу екватора сягають 400—500 м/с. Сатурн має яскраву й велику систему кілець, що складається переважно з частинок льоду, з меншою кількістю скелястих уламків і пилу. Навколо планети обертаються щонайменше 146 супутників."
  },
  {
    "name": "Уран",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Uranus_Voyager2_color_calibrated.png/411px-Uranus_Voyager2_color_calibrated.png",
    "description": "Ура́н — сьома від Сонця велика планета Сонячної системи, що належить до газових гігантів.  Діаметр Урана в 4 рази більший за Землю, а його маса — в 14,5 раза більша за земну, що робить його третьою за діаметром і четвертою за масою планетою Сонячної системи. Уран став першою планетою, відкритою у Новий час. Планета названа ім'ям античного божества Урана. Надра Урана складаються здебільшого з льодів і гірських порід. Основу атмосфери Урана складають водень і гелій. Крім того, у ній виявлені сліди метану та інших вуглеводнів, а також хмари з льоду, твердого аміаку та водню. Уран має найхолоднішу планетарну атмосферу в Сонячній системі з мінімальною температурою 49 К (−224 °C). Вважається, що Уран має складну шарувату структуру хмар, де водяна пара складає нижній шар, а метан — верхній. Уран має систему кілець та магнітосферу. Крім того, навколо нього обертаються 27 супутників. Вісь обертання Урана лежить ніби на боці відносно площини обертання навколо Сонця."
  },
  {
    "name": "Нептун",
    "type": "планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Neptune_Voyager2_color_calibrated.png/360px-Neptune_Voyager2_color_calibrated.png",
    "description": "Непту́н — планета Сонячної системи, восьма за віддаленістю від Сонця. Вона четверта за розміром у Сонячній системі, третя за масою і належить до планет-гігантів. Її орбіта перетинається з орбітою Плутона в деяких місцях. Також орбіту Нептуна перетинає комета Галлея. Маса Нептуна у 17,2 раза, а діаметр екватора у 3,9 раза більший за земний. Планета названа на честь римського бога морів. Нептун було відкрито 23 вересня 1846 року, і він став першою планетою, виявленою завдяки математичним розрахункам. Незабаром було відкрито і його супутник Тритон, проте інші 14 супутників, які відомі зараз, були відкриті лише у XX столітті. Атмосфера Нептуна складається переважно з водню та гелію. Сліди метану в зовнішніх шарах атмосфери є причиною синього забарвлення планети. В атмосфері Нептуна бушують найсильніші вітри серед усіх планет Сонячної системи. Температура у верхніх шарах атмосфери Нептуна — близько −225 °C."
  },
  {
    "name": "Плутон",
    "type": "карликова планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Pluto_in_True_Color_-_High-Res.jpg/450px-Pluto_in_True_Color_-_High-Res.jpg",
    "description": "Плуто́н — найвідоміша карликова планета Сонячної системи та найбільший транснептуновий об'єкт, перший відкритий об'єкт поясу Койпера. Дев'яте за розміром та десяте за масою небесне тіло, яке обертається навколо Сонця. Плутон складається здебільшого з каменю й криги та є відносно малим (діаметр близько 2374 км). Орбіта Плутона має великий ексцентриситет (0,25, тобто вона доволі витягнута) і значний нахил до площини екліптики (17,1°). Плутон то наближається до Сонця на відстань 4,4 млрд км і опиняється ближче, ніж Нептун, то віддаляється на 7,4 млрд км. Плутон перебуває в стабільному орбітальному резонансі з Нептуном, тому їхнє зіткнення виключене. Плутон і його найбільший супутник Харон часто розглядають як подвійну планету. У Плутона є також чотири менші супутники — Нікта й Гідра, відкриті 2005 року, Кербер, відкритий 2011-го, і Стікс, виявлений 2012-го. Єдиний космічний апарат, який досліджував Плутон зблизька, — New Horizons."
  },
  {
    "name": "Сонце",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/The_Sun_by_the_Atmospheric_Imaging_Assembly_of_NASA%27s_Solar_Dynamics_Observatory_-_20100819.jpg/420px-The_Sun_by_the_Atmospheric_Imaging_Assembly_of_NASA%27s_Solar_Dynamics_Observatory_-_20100819.jpg",
    "description": "Со́нце — зоря, що є центром Сонячної системи. Це майже ідеальна куля з гарячої плазми, розігрітої до світіння термоядерними реакціями, що йдуть в її надрах. Земля та сім інших планет обертаються навколо Сонця, як і комети, астероїди, метеороїди, космічний пил та інші дрібні об'єкти. Сонце випромінює переважно у спектрі видимого світла, в ультрафіолетовому та інфрачервоному діапазонах і є найважливішим джерелом енергії для життя на Землі, а також визначає клімат планети. Сонячна світність в середньому становить 3,827⋅10²⁶ Вт. Радіус Сонця становить близько 695 000 км.  Маса Сонця приблизно в 330 000 разів перевищує Земну — це 1.989×10³⁰ кг. Приблизно три чверті маси Сонця становить водень; решта — переважно гелій і набагато менша кількість важчих елементів, зокрема кисень, вуглець, неон, залізо. Він утворився приблизно 4,6 млрд років тому в результаті гравітаційного колапсу речовини в області великої молекулярної хмари."
  },
  {
    "name": "Сіріус",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Sirius_A_and_B_Hubble_photo.jpg",
    "description": "Сіріус — найяскравіша зоря нічного неба. Її світність у 25 разів перевищує світність Сонця. Видимий блиск Сіріуса обумовлений його відносною близькістю. Сіріус можна спостерігати з будь-якого регіону Землі, за винятком її північних областей. Сіріус віддалений на 8,6 св. року від Сонячної системи і є однією з найближчих до нас зір. Він є зорею головної послідовності, спектрального класу A1. У 1844 році Фрідріх Бессель припустив, що Сіріус являє собою подвійну зорю. У 1862 році Алван Кларк виявив зорю-супутник, що отримала позначення Сіріус B. Видиму неозброєним оком зорю позначають Сіріус A. Дві зорі обертаються навколо загального центру мас на відстані приблизно 20 а. о. з періодом, близьким до 50 років. У 1915 році астрономи з обсерваторії Маунт-Вілсон встановили, що Сіріус B є білим карликом.  Із цього випливає, що Сіріус B у минулому мав бути масивніший, ніж Сіріус A."
  },
  {
    "name": "Полярна зірка",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Polaris_system.jpg/195px-Polaris_system.jpg",
    "description": "Полярна зірка — досить яскрава зоря, розташована поблизу Північного полюса світу. Надгігант спектрального класу F7Ib. Видима зоряна величина +1,97m. Полярна зоря перебуває на відстані менш ніж 1° від північного полюса світу і тому майже нерухома під час добового обертання зоряного неба. Полярна є найближчою до Землі цефеїдою (пульсуючою змінною зорею). Полярна зоря насправді являє собою потрійну зоряну систему. У центрі системи розташований надгігант (Полярна А), яскравіший від Сонця більш як у 2000 разів. Полярна B розташована на значному віддаленні від Полярної А, тому побачити її в телескопи можна навіть з поверхні Землі. Однак карликовий супутник центральної зорі — Полярна Ab — розташований так близько до гіганта, що сфотографувати його вдалося лише орбітальному телескопу «Габбл», і то після переналагодження устаткування."
  },
  {
    "name": "Арктур",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Arcturus_%28optical%29.png/450px-Arcturus_%28optical%29.png",
    "description": "Арктур — одиночна зірка у сузір'ї Волопаса з відривом (обчисленому значення паралакса) приблизно 37,3 світлового року від Сонця. Вік зірки визначено як близько 7,1 млрд років. Найяскравіша у сузір'ї Волопаса та у Північній півкулі та четверта за яскравістю зірка нічного неба після Сіріуса, Канопуса та системи Альфа Центавра. Входить у зоряний потік Арктура. Арктур - помаранчевий гігант спектрального класу K1,5IIIFe-0,5, або K0. Видима зоряна величина зірки - 0,05m. Маса – близько 1,3 сонячної, радіус – близько 25,4 сонячної, світність – близько 215 сонячних. Ефективна температура – близько 4251 K. В 1997 году по результатам наблюдений спутника Hipparcos было установлено, что у Арктура есть близкий и яркий компаньон со звёздной величиной +3,5m, удалённый от него на 0,3 угловой секунды. В даний час Арктур вважається одиночною зіркою."
  },
  {
    "name": "Вега",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Vega_Spitzer.jpg/450px-Vega_Spitzer.jpg",
    "description": "Ве́га — найяскравіша зоря в сузір'ї Ліри, п'ята за яскравістю зоря нічного неба, друга після Арктура в північній півкулі. Порівняно близька (25 світлових років від Землі), та, разом з Арктуром і Сіріусом, одна з найяскравіших зір. Близько 12 000 року до н. е. Вега була поляриссимою і приблизно через 12 000 років знову стане нею (внаслідок прецесії). Вона була першою зорею (після Сонця), в якої сфотографували спектр, та однією з перших зір, відстань до якої виміряли за допомогою паралаксу. Назва «Вега» походить від приблизної транслітерації слова waqi, яка означає \"орел, що падає\". Вега нині є найбільш вивченою зорею нічного неба. Вега дуже швидко обертається навколо своєї осі, на її екваторі швидкість обертання досягає 274 км/с. Вега обертається в сто разів швидше ніж Сонце, внаслідок чого має форму еліпсоїда обертання."
  },
  {
    "name": "Рігель",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/7/79/Rigel%2C_Rutherfurd_Observatory%2C_09_September_2014.jpeg",
    "description": "Рі́гель — найяскравіша зоря сузір'я Оріона. Має видиму зоряну величину 0,14m. Біло-блакитний надгігант спектрального класу B8I-a. Температура поверхні 11 200 К, діаметр — близько 95 млн км. Абсолютна зоряна величина дорівнює −6,69m; світність у 60 000 разів більша від сонячної. Таким чином, Рігель — це найпотужніша з яскравих зір небосхилу. Рігель перебуває на відстані приблизно 800 св. років від Сонця. Рігель є нерегулярною пульсуючою змінною зорею (0,05m : 0,18m). Принаймні з 1822 року відомо, що Рігель є оптично-подвійною системою, це визначив Струве. Вже в XIX ст. стало відомо, що Рігель B є тісною подвійною системою. До неї входять дві зорі головної послідовності спектрального класу B9, які перебувають на відстані 0,1—0,2\" та обертаються з періодом 9,86 дня. "
  },
  {
    "name": "Капелла",
    "type": "зоря",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Kapella_Star.jpg",
    "description": "Капелла — найяскравіша зоря у сузір'ї Візничого, шоста за яскравістю на небі. Розташована за 42 світлових роки від Сонця, Капелла є однією зі 100 найближчих зір. Капелла — жовтий гігант. Серед зір першої величини вона найближча до північного полюсу світу (Полярна зоря має другу величину) і, внаслідок цього, відіграє важливу роль міфологічних переказах. Капелла цікава тим, що це спектрально-подвійна зоря. Дві зорі-гіганти спектрального класу G, світністю близько 77 і 78 сонячних віддалені одна від одної на 100 млн км і обертаються з періодом 104,02 доби. Перший і тьмяніший компонент — Капелла Aa вже проеволюціонувала з головної послідовності й перебуває на стадії червоного гіганта, в її надрах вже почалися процеси горіння гелію. Другий, яскравіший компонент — Капелла Ab теж залишила головну послідовність і перебуває у так званому розриві Герцшпрунга, але термоядерне горіння гелію ще не почалося."
  },
  {
    "name": "Чумацький Шлях",
    "type": "галактика",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/ESO-VLT-Laser-phot-33a-07.jpg/375px-ESO-VLT-Laser-phot-33a-07.jpg",
    "description": "Чумацький Шлях — спіральна галактика, у якій розташована наша Сонячна система й майже всі зорі, видимі на небі неозброєним оком. Назва «Чумацький Шлях» походить від світлої туманної смуги на нічному небі, світло якої утворено численними тьмяними зорями в диску Галактики. Більшість зір у Галактиці зосереджено в галактичному диску зі спіральними рукавами. Також Галактика має середніх розмірів балдж (потовщення в центрі) і помірно виражений бар (перемичку). З точки зору морфологічної класифікації Чумацький Шлях відносять до типу SBbc чи SABbc. Диск Чумацького Шляху оточений галактичним гало, в якому міститься невелика частка зір та велика кількість темної матерії. У центрі Галактики розташована надмасивна чорна діра. Радіус зоряного диска Чумацького Шляху становить близько 16 кілопарсек. Повна маса Галактики з урахуванням темної матерії оцінюється в 1—2 × 10¹² M☉. У Чумацькому Шляху є від 100 до 400 мільярдів зір, а його світність становить 2 × 10¹⁰ L☉."
  },
  {
    "name": "Галактика Андромеди",
    "type": "галактика",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Andromeda_Galaxy_%28with_h-alpha%29.jpg/411px-Andromeda_Galaxy_%28with_h-alpha%29.jpg",
    "description": "Галактика Андромеди — найближча до Чумацького Шляху велика галактика, розташована в сузір'ї Андромеди і віддалена від нас, за останніми даними, на відстань 772 кілопарсек (2,52 млн світлових років). Площина галактики нахилена до нас під кутом 15°, її видимий розмір — 3,2°×1°, видима зоряна величина — +3,4 m. Галактика Андромеди, як і Чумацький Шлях, належить до Місцевої групи, і рухається в напрямку до Сонця зі швидкістю 300 км/с. Вона належить до об'єктів, що мають синій зсув. Галактика Андромеди наближається до Чумацького Шляху зі швидкістю 100—140 км/с. Відповідно, зіткнення двох галактичних систем відбудеться приблизно через 3-4 млрд років. Галактика Андромеди має масу в 1,5 рази більшу Чумацького Шляху і є найбільшою в Місцевій групі. Астрономи з'ясували, що до її складу входить близько трильйона зір. У неї є кілька карликових супутників: M32, M110, NGC 185, NGC 147 і, можливо, інші. Її діаметр становить 260 000 світлових років."
  },
  {
    "name": "Галактика Спляча Красуня",
    "type": "галактика",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Blackeyegalaxy.jpg/375px-Blackeyegalaxy.jpg",
    "description": "Галактика Спляча Красуня, Галактика Чорне Око — галактика у сузір'ї Волосся Вероніки. Відкривачем цього об'єкта є Едвард Піготт, який вперше спостерігав за об'єктом 23 березня 1779. Особливістю цього об'єкта є його походження з двох злиплих галактик з різним напрямом обертання. Внаслідок цього газопиловий диск у внутрішній частині об'єкта обертається в протилежну сторону щодо обертання зірок і газу на його периферії. Цей об'єкт входить у число перерахованих в оригінальній редакції нового загального каталогу. У аматорський телескоп спочатку відзначається витягнута еліптична форма галактики і яскраве майже зіркоподібне ядро. Вночі (без штучної і природної засвічення) при апертурі телескопа від 200—300 мм при уважному розгляданні на північний схід від ядра добре видно освіту, що дало назву цьому об'єкту."
  },
  {
    "name": "Галактика Боде",
    "type": "галактика",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Messier_81_HST.jpg/375px-Messier_81_HST.jpg",
    "description": "Галактика Боде — галактика у сузір'ї Велика Ведмедиця. M81 — чудовий приклад будови спіральної галактики, з майже ідеальними рукавами, що доходять майже до самого центру. Завдяки своїй близькості до Землі, своєму великому розміру і активного галактичного ядра (яке може бути супермасивнию чорною дірою), Мессьє 81 досить часто з'являється у фахових астрономічних дослідженнях. Цей об'єкт входить у число перерахованих в оригінальній редакції нового загального каталогу. Мессьє 81 була вперше виявлена Йоганном Боде 31 грудня 1774 року. Більша частина випромінювання в інфрачервоному діапазоні виходить від космічного пилу. Цей космічний пил виявлений, в основному, усередині спіральних рукавів, і, як було показано, пов'язана з формуванням зірок. Зв'язок відбувається тому, що гарячі, короткоживучі блакитні зірки ефективно нагрівають пил і значно посилюють випромінювання з цих регіонів.Тільки одна наднова зірка була виявлена в Галактиці Боде. "
  },
  {
    "name": "4 Веста",
    "type": "астероїд",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Vesta_in_natural_color.jpg/360px-Vesta_in_natural_color.jpg",
    "description": "4 Веста — астероїд, один із найбільших об'єктів у поясі астероїдів (середній діаметр 525 км). Відкрив 29 березня 1807 року німецький астроном Генріх Ольберс. Названий на честь Вести — богині дому й вогнища в римській міфології. Вважається, що Веста є другий об'єкт у поясі астероїдів за масою та об'ємом після карликової планети Церери, хоч об'єм Вести (у межах похибки вимірювань) дорівнює об'єму Паллади. На Весту припадає близько 9 % маси поясу астероїдів. Для наземного спостерігача Веста є найяскравіший астероїд. Його яскравість може досягати 5,1 зоряної величини, і в такі моменти її видно неозброєним оком. 1,2 мільярд років тому Веста зазнав зіткнень з іншими об'єктами, що спричинили формування численних уламків і двох величезних кратерів, які займають більшу частину південної півкулі астероїда. Деякі з уламків упали на Землю у вигляді HED-метеоритів. Найбільше інформації про поверхню Вести маємо завдяки американському космічному апарату «Dawn»."
  },
  {
    "name": "2 Паллада",
    "type": "астероїд",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/d/d4/Potw1749a_Pallas_crop.png",
    "description": "2 Палла́да — астероїд у Сонячній системі. Відкритий 28 березня 1802 року Генріхом Вільгельмом Ольберсом і названий на честь Афіни Паллади. Паллада належить до головного поясу астероїдів. Має геометричне альбедо 0,101, стандартну зоряну величину 4,21m і належить до спектрального класу B. Один оберт навколо власної осі астероїд здійснює за 0,32555 доби (~7,8 год). Паллада є третім за розмірами тілом головного поясу астероїдів, її середній діаметр складає близько 513 км. Наразі Паллада є другим за розміром астероїдом головного поясу після Вести. Ці астероїди є близькими за розміром: об'єм Паллади складає приблизно 90—95 % об'єму Вести. Встановлено майже цілковиту тотожність спектрів Паллади та невеликого астероїда 1580 Бетулія, що може свідчити про їхнє спільне походження. У ніч на 5 квітня 1779 року Шарль Мессьє відмітив Палладу на зоряній карті, яку він використовував для відстеження шляху комети."
  },
  {
    "name": "10 Гігея",
    "type": "астероїд",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/SPHERE_image_of_Hygiea.jpg/333px-SPHERE_image_of_Hygiea.jpg",
    "description": "10 Гігея — астероїд головного поясу, відкритий 12 квітня 1849 року. Гігея — четвертий за розмірами об'єкт головного поясу астероїдів. З діаметром 434 кілометри, або ж 270 миль і масою, яка становить 3% від загальної маси головного астероїдного поясу, це четвертий за величиною астероїд у Сонячній системі як за об’ємом, так і за масою. За деякими спектральними класифікаціями це найбільший серед темних астероїдів типу C з вуглецевою поверхнею, тоді як за іншими він посідає друге місце після 1 Церери. Спостереження, зроблені за допомогою приладу SPHERE Дуже великого телескопа 2017 і 2018 роках і оголошені наприкінці 2019 року, показали, що Гігея має майже сферичну форму та близьку до гідростатичної рівноваги. Тому автори дослідження вважають її можливою карликовою планетою. Проте, припускають, що Гігея була зруйнована ударом, з наступним сміттям, яке знову накопичилося. Руйнівні наслідки створили найбільшу відому родину колізій."
  },
  {
    "name": "Церара",
    "type": "карликова планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/Ceres_-_RC3_-_Haulani_Crater_%2822381131691%29.jpg/360px-Ceres_-_RC3_-_Haulani_Crater_%2822381131691%29.jpg",
    "description": "Цере́ра — карликова планета в поясі астероїдів, в середині Сонячної системи. Це найближча до Землі карликова планета, вона часом наближається на відстань 263 млн км. Відкрита 1 січня 1801 року італійським астрономом Джузеппе Піацці в астрономічній обсерваторії в місті Палермо. Це була перша відкрита карликова планета і перший об'єкт, знайдений у поясі астероїдів. За діаметром близько 952 км. Церера є найбільшим і наймасивнішим тілом у поясі астероїдів, за розміром перевершує багато великих супутників планет-гігантів та містить майже третину (32 %) загальної маси поясу. Вона має кулясту форму, на відміну від більшості інших малих тіл, які мають неправильну форму через низьку гравітацію. Церера стала одною з двох карликових планет, які досліджувала космічна місія NASA «Dawn». Видима зоряна величина Церери становить 6,64m — 9,34m. Стандартна зоряна величина — 3,34m. "
  },
  {
    "name": "Ерида",
    "type": "карликова планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/5/5b/Eris_and_dysnomia2.jpg",
    "description": "Ери́да або Еріс — друга за розміром після Плутона, наймасивніша і найвіддаленіша від Сонця карликова планета Сонячної системи. Назву «Ерида» на честь грецької богині розбрату було ухвалено Міжнародним астрономічним союзом 13 вересня 2006 року. Належить до транснептунових об'єктів та плутоїдів. Діаметр Ериди — близько 2330 км. Ериду відкрили 5 січня 2005 року Майкл Браун, Чедвік Трухільйо та Девід Рабіновіц. Першовідкривачі, а вслід за ними НАСА та деякі ЗМІ оголосили цей об'єкт десятою планетою Сонячної системи, однак 24 серпня 2006 року Міжнародний астрономічний союз затвердив нове визначення планети, за яким Ерида не є планетою. Об'єкт було віднесено до категорії «карликових планет». Середня відстань Ериди від Сонця — 68 а. о. (близько 10 млрд км), але її орбіта дуже витягнута — ексцентриситет дорівнює 0,43."
  },
  {
    "name": "Макемаке",
    "type": "карликова планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/1/14/Makemake_with_moon.png",
    "description": "Макемаке — карликова планета Сонячної системи, транснептуновий об'єкт, плутоїд. Об'єкт відкритий 31 березня 2005 року групою, очолюваною Майклом Брауном. Оголошено про відкриття 29 липня 2005 року. Згідно з даними астрономів із Паломарської обсерваторії (Каліфорнія), Макемаке має діаметр від 50 % до 75 % діаметра Плутона і займає 3-тє (або 4-те) місце за діаметром серед об'єктів поясу Койпера. Щільність Макемаке досягає 1,4–3,2 г/см³. 23 квітня 2011 року планета покрила слабку зорю USNO-B1 1181-0235723, що дало можливість встановити діаметр 1502 × 1430 км, альбедо 0,77. У 2007 році група іспанських астрономів під керівництвом Х. Ортіса установила за зміною яскравості планети її період обертання — 22,48 години. Макемаке позбавлена атмосфери. За розрахунками астрономів, максимальний тиск газу на Макемаке не перевищує 12 мільярдних тиску земної атмосфери. Щільність досягає 1,7 грама на кубічний сантиметр."
  },
  {
    "name": "Гаумеа",
    "type": "карликова планета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/2/2b/Haumea_Hubble.png",
    "description": "Гаумеа або Хаумеа — карликова планета, плутоїд, транснептуновий об'єкт. Згідно з даними астрономів із обсерваторії Паломарської обсерваторії, має діаметр від 50 % до 75 % діаметра Плутона, дуже витягнуту форму й період обертання навколо своєї осі близько 4 годин. Має 2 супутники з періодами обертання 34 і 49 діб. Названа на честь гавайської богині плодючості та дітородження Гаумеа. Супутники Гаумеа отримали назви Хіїака та Намака. В гавайській міфології це доньки Гаумеї. Гаумеа має вузьку систему кілець. Гаумеа була відкрита незалежно американською та іспанською групами астрономів. Іспанська група офіційно оголосила про своє відкриття 29 липня 2005 року, ставши, таким чином, офіційним першовідкривачем. Орбіта Гаумеа нахилена до площини екліптики під кутом 28,2°, помірно витягнута — її ексцентриситет дорівнює 0,1975. Велика піввісь орбіти становить 42,98 а. о., при цьому максимальна відстань від Гаумеа до Сонця дорівнює 51,47 а. о."
  },
  {
    "name": "Гоба",
    "type": "метеорит",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Goba.JPG/420px-Goba.JPG",
    "description": "Гоба — залізний метеорит масою близько 60 тонн. Це найбільший метеорит, знайдений на Землі. Цей залізний метеорит масою 60 тон і об'ємом 9 м³ було знайдено на території сучасної Намібії поблизу Грутфонтейна 1920 року. Метеорит упав на Землю приблизно 80 тисяч років тому і був виявлений цілком випадково. Метеорит Гоба — це щільне металічне тіло. Його горизонтальні розміри 2,95 × 2,84, а висота змінюється від 0,5 до 1,2 м³. На 84 % складається із заліза, на 16 % — із нікелю з невеликими домішками кобальту. Зверху метеорит вкритий гідроксидами заліза. Загалом метеорит як мінерал — це багатий на нікель атаксит. Цікавий він тим, що має порівняно пласку та гладеньку поверхню. "
  },
  {
    "name": "Комета Галлея",
    "type": "комета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Lspn_comet_halley.jpg/375px-Lspn_comet_halley.jpg",
    "description": "Комета Галлея — найвідоміша з комет і найяскравіша з короткоперіодичних комет. Вона наближається до Землі кожні 75—76 років, а її спостереження зафіксовані понад 2000 років тому. Названа на честь англійського астронома Едмонда Галлея, який вирахував її орбіту. Комета Галлея — єдина короткоперіодична комета, яку добре видно неозброєним оком та період обертання якої сумірний з тривалістю людського життя. З кометою пов'язані метеорні потоки Ета-Аквариди й Оріоніди. Останній перигелій був у лютому 1986 року, наступний буде в середині 2061 року. Орбіта комети Галлея — витягнутий еліпс із Сонцем в одному з фокусів.  Орбіта комети сильно нахилена до площини екліптики — на 162,5°. Це означає, що комета рухається в напрямі, протилежному руху планет Сонячної системи. Ексцентриситет орбіти дорівнює 0,967275. Комета Галлея обертається навколо Сонця з періодом приблизно 76 років. Комета в точці перигелію має швидкість 52 км/с, а в афелії — 1 км/с."
  },
  {
    "name": "Комета Енке",
    "type": "комета",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Comet_Encke_from_MESSENGER.png/375px-Comet_Encke_from_MESSENGER.png",
    "description": "Комета Енке — короткоперіодична комета (період обертання 3,3 року). Названа на честь Йоганна Франца Енке, який, вивчивши орбіти кількох комет, прийшов висновку, що та сама періодична комета, і обчислив її орбіту. В 1819 р. Енке опублікував свої висновки і передбачив чергову появу комети в 1822 р. Як і інші комети, комета Енке від проходжень поблизу Сонця поступово руйнується. Діаметр комети за даними космічного апарата «Deep Impact» складав 4,8 км³. За іншими даними, з моменту відкриття комета Енке втратила 85 % маси і зараз має діаметр 2 км⁴.  Комета рухається з прискоренням, викликаним реактивною силою викиду з ядра речовини. Прискорення зменшується внаслідок виснаження запасів летких речовин в ядрі. Існує гіпотеза, що Тунгуський метеорит був уламком комети Енке. Астероїд 2004 TG10 може бути фрагментом комети Енке."
  },
  {
    "name": "Місяць",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Moon_apollo12.jpg/420px-Moon_apollo12.jpg",
    "description": "Мі́сяць — єдиний природний супутник Землі. У Сонячній системі це найбільший і наймасивніший супутник по відношенню до своєї материнської планети, п'ятий за розміром і найбільший супутник планет земної групи. Місяць обертається навколо Землі на середній відстані, що приблизно в 30 разів перевищує діаметр Землі. Припливні сили між Землею та Місяцем з часом синхронізували орбітальний період Місяця (синодичний місяць) із періодом його обертання (місячна доба) у 29,5 земних днів, через що одна сторона Місяця завжди повернена до Землі. Гравітаційне тяжіння Місяця — є однією з головних причин припливів і відпливів на Землі. Місяць є першим і єдиним позаземним тілом природного походження, на якому побувала людина. Його поверхнева гравітація становить приблизно одну шосту земної. Супутник утворився 4,46 мільярда років тому. Поверхня Місяця вкрита місячним пилом, горами, ударними кратерами, системами променів, борознами та темними «морями»."
  },
  {
    "name": "Фобос",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Phobos_moon_%28large%29.jpg/360px-Phobos_moon_%28large%29.jpg",
    "description": "Фобос — один з двох супутників Марса. Фобос — внутрішній супутник, який був відкритий американським астрономом Асафом Голлом 17 серпня 1877 року. Супутник названий на честь давньогрецького бога Фобоса. Фобос обертається на середній відстані 2,77 радіуса Марса від центра планети (9400 км). Перицентр становить 9235,6 км, апоцентр — 9518,8 км. Він робить один оберт за 7 год 39 хв 14 с. На марсіанському небі Фобос сходить на заході і заходить на сході. Фобос обертається навколо своєї осі з тим же періодом, що й навколо Марса, тому завжди повернутий до планети одним і тим самим боком. Розміри Фобоса становлять 26,8×22,4×18,4 км, його поверхня всіяна кратерами, найбільший із яких, Стікні, має діаметр близько 9 км. З кратером пов'язана мережа розломів і тріщин. Дослідження 2015 року пов'язує утворення тріщин та борозен на поверхні Фобоса із процесами його руйнування під дією припливних сил з боку Марса."
  },
  {
    "name": "Європа",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Europa-moon.jpg/420px-Europa-moon.jpg",
    "description": "Європа, або Юпітер II — супутник Юпітера, найменший з чотирьох галілеєвих супутників. Європа посідає шосте місце в списку найближчих до Юпітера супутників, а також шосте місце за розміром серед супутників у Сонячній Системі. Відкрита 1610 року Галілео Галілеєм та, можливо, Симоном Маріусом. Супутник було названо на честь фінікійської матері царя Міноса Критського і коханки Зевса. Діаметр Європи складає 3138 км. Європа складається з силікатних порід, має залізо-нікелеве ядро. Дуже розріджена атмосфера Європи переважно складається з кисню. Поверхня з льоду є однією з найбільш гладких у Сонячній системі, має мало кратерів, але багато світло-коричневих тріщин. Існує гіпотеза, що під гладкою поверхнею розташовується водяний океан, в якому могло б існувати життя у вигляді одноклітинних організмів та бактерієподібних істот."
  },
  {
    "name": "Мімас",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Mimas_Cassini.jpg/420px-Mimas_Cassini.jpg",
    "description": "Мімас — десятий за віддаленістю від планети і сьомий за розміром природний супутник Сатурна, його відкрив В. Гершель у 1789 році. Він має сферичну форму. Діаметр 400 км. Радіус орбіти 185,5 тис. км. На супутнику присутній великий кратер, який має назву Гершель, діаметром 130 км. Це, скоріш за все, слід падіння велетенського метеорита. Як і більшість супутників Сатурна складається з льоду, густина якого приблизно 1200—1400 кг/м³. Назва «Мімас» запропонована Джоном Гершелем у 1847 році на честь Мімаса, сина Геї з грецької міфології. Через припливні сили Сатурна, які діють на супутник, Мімас не зовсім сферичний, його розміри супутника 414,8×394,4×381,4 кілометрів. Щілина Кассіні, проміжок між двома найширшими кільцями Сатурна, утворилася через взаємодію Мімаса. Орбітальний апарат Кассіні сфотографував Мімас, коли увійшов у орбіту Сатурна в 2004 році."
  },
  {
    "name": "Арієль",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Ariel_in_monochrome.jpg/420px-Ariel_in_monochrome.jpg",
    "description": "Арієль, або Аріель — четвертий за величиною супутник Урана. Відкритий 24 жовтня 1851 року Вільямом Ласселлом одночасно з Умбріелем, і названий на честь ведучого сильфа з поеми Александра Поупа «Викрадення локона», а також духа, що служив Просперо у творі Вільяма Шекспіра «Буря». Майже всі наявні дані про Аріель отримані в ході прольоту космічного апарата «Вояджер-2» 1986 року. Знято лише 35 % його поверхні. Аріель — один із найменших кулястих супутників у Сонячній системі (14-й за розміром із 19). Він складається приблизно наполовину з льоду і наполовину з кам'янистих порід і, цілком можливо, диференційований на кам'яне ядро і крижану мантію. Як і всі великі супутники Урана, Аріель, ймовірно, утворився з акреційного диска, що оточував планету деякий час після її формування. У Аріеля складний рельєф поверхні — сильно кратеровані ділянки перетинаються обривами, каньйонами і гірськими хребтами."
  },
  {
    "name": "Тритон",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Triton_moon_mosaic_Voyager_2_%28large%29.jpg/420px-Triton_moon_mosaic_Voyager_2_%28large%29.jpg",
    "description": "Трито́н — найбільший серед супутників Нептуна. Обертання синхронне (постійно обернений до Нептуна одним боком). Передній бік (за рухом супутника) приблизно на 25 % темніший решти його поверхні. Має азотну атмосферу. Температура на поверхні Тритона становить лише 34,5 K (–235 °C). Настільки низька температура зумовлена зокрема високим альбедо (70—80 %). За такої температури метан, азот і двоокис вуглецю заморожені до твердого стану. Має зоряну величину 14. Відстань від Нептуна 394 700 км, сидеричний період обертання 5 діб 21 год. 3 хв., діаметр близько 2706 км, що трохи менше діаметра Місяця, хоча маса його менша в 3,5 рази. Це єдиний великий супутник Сонячної системи, який обертається навколо своєї планети в протилежний бік від обертання планети навколо своєї осі. Через таке обертання Тритон поступово втрачає енергію внаслідок дії припливних сил, і, зрештою, або зруйнується, або впаде на Нептун. Тритон — найхолодніше місце в Сонячній системі."
  },
  {
    "name": "Харон",
    "type": "супутник",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Charon_in_Color_%28HQ%29.jpg/420px-Charon_in_Color_%28HQ%29.jpg",
    "description": "Харо́н (134340 Плутон I) — найбільший із п'яти відомих супутників карликової планети Плутона, відомий також під назвою «Плутон I». Гравітаційний вплив Харона на Плутон настільки великий, що барицентр системи Плутон — Харон лежить поза Плутоном. Через це його інколи вважають компонентом подвійної планетної системи Плутон — Харон. Відкритий 22 червня 1978 року американським астрофізиком Джеймсом Крісті на знімках, отриманих на кілька місяців раніше у Військово-морській обсерваторії США. Названий на честь Харона із давньогрецької міфології — перевізника душ через річку Ахеронт у царство мертвих. 14 липня 2015 року автоматична міжпланетна станція New Horizons пролітала через систему Плутон — Харон, наблизившись до Харона на відстань близько 27 тис. км. орбіта лежить приблизно в екваторіальній площині Плутона й нахилена на 122,5° до екліптики. Діаметр Харона, за даними апарата New Horizons, складає 1212±6 км."
  },
  {
    "name": "Андромеда",
    "type": "сузір'я",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Andromeda_IAU_uk.svg/450px-Andromeda_IAU_uk.svg.png",
    "description": "Андроме́да — сузір'я в північній півкулі зоряного неба, назване на честь героїні грецького міфу Андромеди, вродливої доньки Кассіопеї. Сузір'я можна легко відшукати на небосхилі: треба знайти Великий квадрат, верхня ліва зоря якого — α Андромеди, яка разом з β, γ і δ утворюють майже пряму лінію. Сузір'я примітне насамперед тим, що містить одну з найвідоміших галактик — Туманність Андромеди (М 31) — найближчу до нас спіральну галактику, яку видно навіть неозброєним оком. Найкращий час та місце для спостередення Андромеди - ввечері восени в Північній півкулі. Через її північне схилення Андромеду видно лише на північ від 40° південної широти. Одне з найбільших сузір'їв, його площа становить 722 квадратних градуси. Найяскравіша зоря, Альфераз, — це подвійна зоря, яку також вважають частиною Пегаса. Андромеда — це місце розташування радіанта Андромедид, слабкого метеорного потоку, який відбувається в листопаді. "
  },
  {
    "name": "Близнята",
    "type": "сузір'я",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/GEM_uk.svg/450px-GEM_uk.svg.png",
    "description": "Близня́та — це одне з 12 зодіакальних сузір’їв, яке розташоване на північному небі. Його можна побачити взимку та навесні, особливо добре в північній півкулі. Це сузір’я було описане ще в II столітті нашої ери давньогрецьким астрономом Клавдієм Птолемеєм, і з тих пір залишається частиною офіційного списку 88 сучасних сузір’їв. Свою назву Близнята отримали від латинського слова Gemini, що означає «близнюки». Це пов’язано з давньогрецьким міфом про братів Кастора та Полідевка (Поллукса). Це сузір’я містить дві яскраві зорі — Поллукс і Кастор. Також у сузір’ї Близнят можна знайти цікаві астрономічні об’єкти, наприклад, розсіяне зоряне скупчення M35. Це скупчення містить сотні зір і добре помітне навіть у невеликий телескоп. Символ цього сузір’я — ♊︎, і він часто використовується в астрології, оскільки Близнята є одним зі знаків зодіаку. У сузір’ї Близнята можна знайти 85 зір, які видно неозброєним оком у ясну ніч."
  },
  {
    "name": "Велика Ведмедиця",
    "type": "сузір'я",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/UMA_uk.svg/450px-UMA_uk.svg.png",
    "description": "Вели́ка Ведме́диця (українська історична назва — Вели́кий Ві́з) — сузір'я північної небесної півкулі. Третє за площею сузір'я на небі й найбільше сузір'я у Північній півкулі. За рахунок великої площі, яку займає сузір'я на небі, в ньому розташовано три метеорні потоки, туманність Сова, багато яскравих для земного спостерігача галактик, а також окремих зір, що мають певні особливості (змінні, яскраві, одні з найближчих тощо). Сузір'я відоме з античності і з'являється в культурах різних народів світу. Велика Ведмедиця є третім за величиною сузір'ям на небі, займаючи площу 1280 квадратних градусів. Його можна побачити на широтах від +90° до –30°. Шість зір сузір'я утворюють відомий астеризм, відомий як Великий Віз або Великий Ківш. Назви цих зір: Алькайд, Міцар, Аліот, Мегрец, Фекда, Мерак та Дубхе."
  }
]