[
  {
    "name": "Логарифм",
    "poster": "https://interactive.ranok.com.ua/upload/image/%D0%90%D0%BB%D0%B3%D0%B5%D0%B1%D1%80%D0%B0_%207-11%20%D0%A0%D1%8F%D1%82%D1%96%D0%B2%D0%BD%D0%B8%D0%BA%202_0/c11.jpg",
    "description": "Логарифмом додатного числа  b з основою  a (a>0, a≠1) називається показник степеня, до якого треба піднести a, щоб отримати b.\n1.Логарифм від 1 за будь-якою основою дорівнює 0;\n2.Логарифм від числа за тією ж основою дорівнює 1;\n3.Логарифм добутку двох додатних чисел дорівнює сумі логарифмів цих чисел;\n4. Логарифм частки дорівнює різниці логарифмів діленого і дільника;\n5. Логарифм степеня дорівнює добутку показника степеня на логарифм основи степеня;\n6.Якщо a>0,a≠1,b>0,c>0,c≠1, тоді правильна рівність.",
    "link": "https://www.youtube.com/watch?v=YGYnM9C-7eU"
  },
  {
    "name": "Теорема Піфагора",
    "poster": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRtzH2QbmzuDSxpQ0hE1XSpOtpTtS9bL6InFJx2eHgZTBg0FUY4C0fioasPZOfkUhisfOw&usqp=CAU",
    "description": "Теоре́ма Піфаго́ра — одна із засадничих теорем евклідової геометрії, яка встановлює співвідношення між сторонами прямокутного трикутника. Теорема звучить так: \nУ прямокутному трикутнику площа квадрата, побудованого на гіпотенузі, дорівнює сумі площ квадратів, побудованих на катетах. \nОтже, теорема Піфагора встановлює співвідношення, яке дає змогу визначити довжину сторони прямокутного трикутника, знаючи довжини двох інших. Відповідно, в алгебраїчній інтерпретації теорему можна сформулювати так: \nУ прямокутному трикутнику сума квадратів катетів дорівнює квадрату гіпотенузи. ",
    "link": "https://www.youtube.com/watch?v=EaN-JbyA348"
  },
  {
    "name": "Факторіал",
    "poster": "https://skillbox.ru/upload/setka_images/13335118052023_278cadb5c5a600fd354bbb4a32acf34407bf98f0.png",
    "description": "Факторіал натурального числа n — добуток натуральних чисел від одиниці до n включно, позначається n!. \nЗа означенням 0!=1, згідно з конвенцією для порожнього добутку. \nПри великих n наближене значення факторіала можна обчислити за формулою Стірлінга. \nФакторіал n дорівнює кількості перестановок з n елементів.",
    "link": "https://www.youtube.com/watch?v=An3bSyxo7VY"
  },
  {
    "name": "Теорема Чеви",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Ceva%27s_theorem_1.svg/330px-Ceva%27s_theorem_1.svg.png",
    "description": "Теорема Чеви — відома теорема класичної геометрії. Нехай дано трикутник ABC, і точки D, E, і F, що лежать на прямих BC, CA, і AB відповідно. Теорема стверджує, що лінії AD, BE і CF конкурентні тоді і тільки тоді якщо: \nAF/FB * BD/DC * CE/EA = 1. \nЄ також аналогічне тригонометричне формулювання Теореми Чеви, а саме AD, BE, CF конкурентні тоді і тільки тоді: \nsin BAD/sin CAD * sin ACF/sin BCF *sin CBE/sin ABE = 1.\nТеорему довів в 1678 році Джованні Чева в праці De lineis rectis, але її також довів набагато раніше Юсуф Аль-Мутаман ібн Худ, король Сарагоси в XI столітті.",
    "link": "https://www.youtube.com/watch?v=tNEz0JjmviY"
  },
  {
    "name": "Теорема Менелая",
    "poster": "https://upload.wikimedia.org/wikipedia/ru/c/ca/Teorema_menelaya.gif",
    "description": "Теорема Менелая, або теорема про трансверсали, або теорема про повного чотиристоронника, - класична теорема афінної геометрії. \nЯкщо точки A',B' і C'лежать відповідно на сторонах BC, CA і AB трикутника ABC або на їх продовженнях, то вони колінеарні тоді і тільки тоді, де AB'/B'C * CA'/A'B * BC'/C'A позначають відносини спрямованих відрізків.",
    "link": "https://www.youtube.com/watch?v=tNEz0JjmviY"
  },
  {
    "name": "Теорема Фалеса",
    "poster": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Thales-sov.jpg",
    "description": "Теорема Фалеса — теорема планіметрії про набір паралельних прямих, що січуть до пари. Якщо на одній із двох прямих відкласти послідовно кілька рівних між собою відрізків і через їх кінці провести паралельні прямі, що перетинають другу пряму, то вони відсічуть на другій прямі рівні між собою відрізки. Більш загальне формулювання, також зване теорема про пропорційні відрізки\nПаралельні січучі утворюють на прямих пропорційні відрізки: \nA1A2/B1B2 = A2A3/B2B3 = A1A3/B1B3 \nЦя теорема приписується грецькому математику та філософу Фалесу Мілетському .За легендою, Фалес Мілетський розраховував висоту піраміди Хеопса, вимірюючи довжину її тіні землі і довжину тіні палиці відомої висоти.",
    "link": "https://www.youtube.com/watch?v=9UoZr_-7tLk"
  }
]